Revit 2027 API
ParameterTypeId.AnalyticalModelWallProjection Property
 "z Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelWallProjection { get; }
Public Shared ReadOnly Property AnalyticalModelWallProjection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelWallProjection {
	ForgeTypeId^ get ();
}
static member AnalyticalModelWallProjection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace